var provinces = [
  {
    "name" : "北京市",
    "id" : "1"
  },
  {
    "name" : "上海市",
    "id" : "2"
  },
  {
    "name" : "天津市",
    "id" : "3"
  },
  {
    "name" : "重庆市",
    "id" : "4"
  },
  {
    "name" : "河北省",
    "id" : "5"
  },
  {
    "name" : "山西省",
    "id" : "6"
  },
  {
    "name" : "内蒙古自治区",
    "id" : "7"
  },
  {
    "name" : "辽宁省",
    "id" : "8"
  },
  {
    "name" : "吉林省",
    "id" : "9"
  },
  {
    "name" : "黑龙江省",
    "id" : "10"
  },
  {
    "name" : "江苏省",
    "id" : "11"
  },
  {
    "name" : "浙江省",
    "id" : "12"
  },
  {
    "name" : "安徽省",
    "id" : "13"
  },
  {
    "name" : "福建省",
    "id" : "14"
  },
  {
    "name" : "江西省",
    "id" : "15"
  },
  {
    "name" : "山东省",
    "id" : "16"
  },
  {
    "name" : "河南省",
    "id" : "17"
  },
  {
    "name" : "湖北省",
    "id" : "18"
  },
  {
    "name" : "湖南省",
    "id" : "19"
  },
  {
    "name" : "广东省",
    "id" : "20"
  },
  {
    "name" : "广西壮族自治区",
    "id" : "21"
  },
  {
    "name" : "四川省",
    "id" : "22"
  },
  {
    "name" : "云南省",
    "id" : "23"
  },
  {
    "name" : "贵州省",
    "id" : "24"
  },
  {
    "name" : "陕西省",
    "id" : "25"
  },
  {
    "name" : "甘肃省",
    "id" : "26"
  },
  {
    "name" : "新疆维吾尔族自治区",
    "id" : "27"
  },
  {
    "name" : "海南省",
    "id" : "28"
  },
  {
    "name" : "宁夏回族自治区",
    "id" : "29"
  },
  {
    "name" : "青海省",
    "id" : "30"
  },
  {
    "name" : "西藏自治区",
    "id" : "31"
  },
  {
    "name" : "军事系统",
    "id" : "32"
  }
]
var universitys = {
"1" : [
  {
    "name":"清华大学",
    "id":"1",
    "province":"北京"
  },
  {
    "name":"北京大学",
    "id":"2",
    "province":"北京"
  },
  {
    "name":"中国人民大学",
    "id":"3",
    "province":"北京"
  },
  {
    "name":"中央财经大学",
    "id":"4",
    "province":"北京"
  },
  {
    "name":"北京邮电大学",
    "id":"5",
    "province":"北京"
  },
  {
    "name":"北京航空航天大学",
    "id":"6",
    "province":"北京"
  },
  {
    "name":"北京工业大学",
    "id":"7",
    "province":"北京"
  },
  {
    "name":"北京理工大学",
    "id":"8",
    "province":"北京"
  },
  {
    "name":"北京化工大学",
    "id":"9",
    "province":"北京"
  },
  {
    "name":"对外经济贸易大学",
    "id":"10",
    "province":"北京"
  },
  {
    "name":"中国传媒大学",
    "id":"11",
    "province":"北京"
  },
  {
    "name":"中央民族大学",
    "id":"12",
    "province":"北京"
  },
  {
    "name":"中国矿业大学(北京)",
    "id":"13",
    "province":"北京"
  },
  {
    "name":"中国政法大学",
    "id":"14",
    "province":"北京"
  },
  {
    "name":"中国石油大学(北京)",
    "id":"15",
    "province":"北京"
  },
  {
    "name":"中央音乐学院",
    "id":"16",
    "province":"北京"
  },
  {
    "name":"北京体育大学",
    "id":"17",
    "province":"北京"
  },
  {
    "name":"北京外国语大学",
    "id":"18",
    "province":"北京"
  },
  {
    "name":"北京交通大学",
    "id":"19",
    "province":"北京"
  },
  {
    "name":"北京科技大学",
    "id":"20",
    "province":"北京"
  },
  {
    "name":"北京林业大学",
    "id":"21",
    "province":"北京"
  },
  {
    "name":"中国农业大学",
    "id":"22",
    "province":"北京"
  },
  {
    "name":"北京中医药大学",
    "id":"23",
    "province":"北京"
  },
  {
    "name":"华北电力大学(北京)",
    "id":"24",
    "province":"北京"
  },
  {
    "name":"北京师范大学",
    "id":"25",
    "province":"北京"
  },
  {
    "name":"中国地质大学(北京)",
    "id":"26",
    "province":"北京"
  },
  {
    "name":"北京其他高校",
    "id":"1027",
    "province":"北京"
  }],
"2" : [
  {
    "name":"复旦大学",
    "id":"27",
    "province":"上海"
  },
  {
    "name":"上海交通大学",
    "id":"28",
    "province":"上海"
  },
  {
    "name":"华东师范大学",
    "id":"29",
    "province":"上海"
  },
  {
    "name":"同济大学",
    "id":"30",
    "province":"上海"
  },
  {
    "name":"上海财经大学",
    "id":"31",
    "province":"上海"
  },
  {
    "name":"上海外国语大学",
    "id":"32",
    "province":"上海"
  },
  {
    "name":"上海大学",
    "id":"33",
    "province":"上海"
  },
  {
    "name":"华东理工大学",
    "id":"34",
    "province":"上海"
  },
  {
    "name":"东华大学",
    "id":"35",
    "province":"上海"
  },
  {
    "name":"上海其他高校",
    "id":"1036",
    "province":"上海"
  }],
"3" : [
  {
    "name":"南开大学",
    "id":"36",
    "province":"天津"
  },
  {
    "name":"天津大学",
    "id":"37",
    "province":"天津"
  },
  {
    "name":"天津医科大学",
    "id":"38",
    "province":"天津"
  },
  {
    "name":"河北工业大学",
    "id":"39",
    "province":"天津"
  },
  {
    "name":"天津其他高校",
    "id":"1040",
    "province":"天津"
  }],
"4" : [
  {
    "name":"重庆大学",
    "id":"40",
    "province":"重庆"
  },
  {
    "name":"西南大学",
    "id":"41",
    "province":"重庆"
  },
  {
    "name":"重庆其他高校",
    "id":"1042",
    "province":"重庆"
  }],
"5" : [
  {
    "name":"华北电力大学(保定)",
    "id":"42",
    "province":"河北"
  },
  {
    "name":"河北其他高校",
    "id":"1043",
    "province":"河北"
  }],
"6" : [
  {
    "name":"太原理工大学",
    "id":"43",
    "province":"山西"
  },
  {
    "name":"山西其他高校",
    "id":"1044",
    "province":"山西"
  }],
"7" : [
  {
    "name":"内蒙古大学",
    "id":"44",
    "province":"内蒙古"
  },
  {
    "name":"内蒙古其他高校",
    "id":"1045",
    "province":"内蒙古"
  }],
"8" : [
  {
    "name":"大连理工大学",
    "id":"45",
    "province":"辽宁"
  },
  {
    "name":"东北大学",
    "id":"46",
    "province":"辽宁"
  },
  {
    "name":"辽宁大学",
    "id":"47",
    "province":"辽宁"
  },
  {
    "name":"大连海事大学",
    "id":"48",
    "province":"辽宁"
  },
  {
    "name":"辽宁其他高校",
    "id":"1049",
    "province":"辽宁"
  }],
"9" : [
  {
    "name":"吉林大学",
    "id":"49",
    "province":"吉林"
  },
  {
    "name":"东北师范大学",
    "id":"50",
    "province":"吉林"
  },
  {
    "name":"延边大学",
    "id":"51",
    "province":"吉林"
  },
  {
    "name":"吉林其他高校",
    "id":"1052",
    "province":"吉林"
  }],
"10" : [
  {
    "name":"东北农业大学",
    "id":"52",
    "province":"黑龙江"
  },
  {
    "name":"东北林业大学",
    "id":"53",
    "province":"黑龙江"
  },
  {
    "name":"哈尔滨工业大学",
    "id":"54",
    "province":"黑龙江"
  },
  {
    "name":"哈尔滨工程大学",
    "id":"55",
    "province":"黑龙江"
  },
  {
    "name":"黑龙江其他高校",
    "id":"1056",
    "province":"黑龙江"
  }],
"11" : [
  {
    "name":"南京大学",
    "id":"56",
    "province":"江苏"
  },
  {
    "name":"东南大学",
    "id":"57",
    "province":"江苏"
  },
  {
    "name":"苏州大学",
    "id":"58",
    "province":"江苏"
  },
  {
    "name":"河海大学",
    "id":"59",
    "province":"江苏"
  },
  {
    "name":"中国药科大学",
    "id":"60",
    "province":"江苏"
  },
  {
    "name":"中国矿业大学(徐州)",
    "id":"61",
    "province":"江苏"
  },
  {
    "name":"南京师范大学",
    "id":"62",
    "province":"江苏"
  },
  {
    "name":"南京理工大学",
    "id":"63",
    "province":"江苏"
  },
  {
    "name":"南京航空航天大学",
    "id":"64",
    "province":"江苏"
  },
  {
    "name":"江南大学",
    "id":"65",
    "province":"江苏"
  },
  {
    "name":"南京农业大学",
    "id":"66",
    "province":"江苏"
  },
  {
    "name":"江苏其他高校",
    "id":"1067",
    "province":"江苏"
  }],
"12" : [
  {
    "name":"浙江大学",
    "id":"67",
    "province":"浙江"
  },
  {
    "name":"浙江其他高校",
    "id":"1068",
    "province":"浙江"
  }],
"13" : [
  {
    "name":"安徽大学",
    "id":"68",
    "province":"安徽"
  },
  {
    "name":"合肥工业大学",
    "id":"69",
    "province":"安徽"
  },
  {
    "name":"中国科学技术大学",
    "id":"70",
    "province":"安徽"
  },
  {
    "name":"安徽其他高校",
    "id":"1071",
    "province":"安徽"
  }],
"14" : [
  {
    "name":"厦门大学",
    "id":"71",
    "province":"福建"
  },
  {
    "name":"福州大学",
    "id":"72",
    "province":"福建"
  },
  {
    "name":"福建其他高校",
    "id":"1073",
    "province":"福建"
  }],
"15" : [
  {
    "name":"南昌大学",
    "id":"73",
    "province":"江西"
  },
  {
    "name":"江西其他高校",
    "id":"1074",
    "province":"江西"
  }],
"16" : [
  {
    "name":"山东大学",
    "id":"74",
    "province":"山东"
  },
  {
    "name":"中国海洋大学",
    "id":"75",
    "province":"山东"
  },
  {
    "name":"中国石油大学(华东)",
    "id":"76",
    "province":"山东"
  },
  {
    "name":"山东其他高校",
    "id":"1077",
    "province":"山东"
  }],
"17" : [
  {
    "name":"郑州大学",
    "id":"77",
    "province":"河南"
  },
  {
    "name":"河南其他高校",
    "id":"1078",
    "province":"河南"
  }],
"18" : [
  {
    "name":"武汉大学",
    "id":"78",
    "province":"湖北"
  },
  {
    "name":"华中科技大学",
    "id":"79",
    "province":"湖北"
  },
  {
    "name":"中国地质大学(武汉)",
    "id":"80",
    "province":"湖北"
  },
  {
    "name":"华中师范大学",
    "id":"81",
    "province":"湖北"
  },
  {
    "name":"华中农业大学",
    "id":"82",
    "province":"湖北"
  },
  {
    "name":"中南财经政法大学",
    "id":"83",
    "province":"湖北"
  },
  {
    "name":"武汉理工大学",
    "id":"84",
    "province":"湖北"
  },
  {
    "name":"湖北其他高校",
    "id":"1085",
    "province":"湖北"
  }],
"19" : [
  {
    "name":"湖南大学",
    "id":"85",
    "province":"湖南"
  },
  {
    "name":"中南大学",
    "id":"86",
    "province":"湖南"
  },
  {
    "name":"湖南师范大学",
    "id":"87",
    "province":"湖南"
  },
  {
    "name":"湖南其他高校",
    "id":"1088",
    "province":"湖南"
  }],
"20" : [
  {
    "name":"中山大学",
    "id":"88",
    "province":"广东"
  },
  {
    "name":"暨南大学",
    "id":"89",
    "province":"广东"
  },
  {
    "name":"华南理工大学",
    "id":"90",
    "province":"广东"
  },
  {
    "name":"华南师范大学",
    "id":"91",
    "province":"广东"
  },
  {
    "name":"广东其他高校",
    "id":"1092",
    "province":"广东"
  }],
"21" : [
  {
    "name":"广西大学",
    "id":"92",
    "province":"广西"
  },
  {
    "name":"广西其他高校",
    "id":"1093",
    "province":"广西"
  }],
"22" : [
  {
    "name":"四川大学",
    "id":"93",
    "province":"四川"
  },
  {
    "name":"西南交通大学",
    "id":"94",
    "province":"四川"
  },
  {
    "name":"电子科技大学",
    "id":"95",
    "province":"四川"
  },
  {
    "name":"西南财经大学",
    "id":"96",
    "province":"四川"
  },
  {
    "name":"四川农业大学",
    "id":"97",
    "province":"四川"
  },
  {
    "name":"四川其他高校",
    "id":"1098",
    "province":"四川"
  }],
"23" : [
  {
    "name":"云南大学",
    "id":"98",
    "province":"云南"
  },
  {
    "name":"云南其他高校",
    "id":"1099",
    "province":"云南"
  }],
"24" : [
  {
    "name":"贵州大学",
    "id":"99",
    "province":"贵州"
  },
  {
    "name":"贵州其他高校",
    "id":"1100",
    "province":"贵州"
  }],
"25" : [
  {
    "name":"西北大学",
    "id":"100",
    "province":"陕西"
  },
  {
    "name":"西安交通大学",
    "id":"101",
    "province":"陕西"
  },
  {
    "name":"西北工业大学",
    "id":"102",
    "province":"陕西"
  },
  {
    "name":"陕西师范大学",
    "id":"103",
    "province":"陕西"
  },
  {
    "name":"西北农林科大",
    "id":"104",
    "province":"陕西"
  },
  {
    "name":"西安电子科技大学",
    "id":"105",
    "province":"陕西"
  },
  {
    "name":"长安大学",
    "id":"106",
    "province":"陕西"
  },
  {
    "name":"陕西其他高校",
    "id":"1107",
    "province":"陕西"
  }],
"26" : [
  {
    "name":"兰州大学",
    "id":"107",
    "province":"甘肃"
  },
  {
    "name":"甘肃其他高校",
    "id":"1108",
    "province":"甘肃"
  }],
"27" : [
  {
    "name":"新疆大学",
    "id":"108",
    "province":"新疆"
  },
  {
    "name":"石河子大学",
    "id":"109",
    "province":"新疆"
  },
  {
    "name":"新疆其他高校",
    "id":"1110",
    "province":"新疆"
  }],
"28" : [
  {
    "name":"海南大学",
    "id":"110",
    "province":"海南"
  },
  {
    "name":"海南其他高校",
    "id":"1111",
    "province":"海南"
  }],
"29" : [
  {
    "name":"宁夏大学",
    "id":"111",
    "province":"宁夏"
  },
  {
    "name":"宁夏其他高校",
    "id":"1112",
    "province":"宁夏"
  }],
"30" : [
  {
    "name":"青海大学",
    "id":"112",
    "province":"青海"
  },
  {
    "name":"青海其他高校",
    "id":"1113",
    "province":"青海"
  }],
"31" : [
  {
    "name":"西藏大学",
    "id":"113",
    "province":"西藏"
  },
  {
    "name":"西藏其他高校",
    "id":"1114",
    "province":"西藏"
  }],
"32" : [
  {
    "name":"第二军医大学",
    "id":"114",
    "province":"军事系统"
  },
  {
    "name":"第四军医大学",
    "id":"115",
    "province":"军事系统"
  },
  {
    "name":"国防科学技术大学",
    "id":"116",
    "province":"军事系统"
  },
  {
    "name":"军事系统其他高校",
    "id":"1117",
    "province":"军事系统"
  }]
}


var idToUniversitys = {
    "U1" : "清华大学",
    "U2" : "北京大学",
    "U3" : "中国人民大学",
    "U4" : "中央财经大学",
    "U5" : "北京邮电大学",
    "U6" : "北京航空航天大学",
    "U7" : "北京工业大学",
    "U8" : "北京理工大学",
    "U9" : "北京化工大学",
    "U10" : "对外经济贸易大学",
    "U11" : "中国传媒大学",
    "U12" : "中央民族大学",
    "U13" : "中国矿业大学(北京)",
    "U14" : "中国政法大学",
    "U15" : "中国石油大学(北京)",
    "U16" : "中央音乐学院",
    "U17" : "北京体育大学",
    "U18" : "北京外国语大学",
    "U19" : "北京交通大学",
    "U20" : "北京科技大学",
    "U21" : "北京林业大学",
    "U22" : "中国农业大学",
    "U23" : "北京中医药大学",
    "U24" : "华北电力大学(北京)",
    "U25" : "北京师范大学",
    "U26" : "中国地质大学(北京)",
    "U1027" : "北京其他高校",
    "U27" : "复旦大学",
    "U28" : "上海交通大学",
    "U29" : "华东师范大学",
    "U30" : "同济大学",
    "U31" : "上海财经大学",
    "U32" : "上海外国语大学",
    "U33" : "上海大学",
    "U34" : "华东理工大学",
    "U35" : "东华大学",
    "U1036" : "上海其他高校",
    "U36" : "南开大学",
    "U37" : "天津大学",
    "U38" : "天津医科大学",
    "U39" : "河北工业大学",
    "U1040" : "天津其他高校",
    "U40" : "重庆大学",
    "U41" : "西南大学",
    "U1042" : "重庆其他高校",
    "U42" : "华北电力大学(保定)",
    "U1043" : "河北其他高校",
    "U43" : "太原理工大学",
    "U1044" : "山西其他高校",
    "U44" : "内蒙古大学",
    "U1045" : "内蒙古其他高校",
    "U45" : "大连理工大学",
    "U46" : "东北大学",
    "U47" : "辽宁大学",
    "U48" : "大连海事大学",
    "U1049" : "辽宁其他高校",
    "U49" : "吉林大学",
    "U50" : "东北师范大学",
    "U51" : "延边大学",
    "U1052" : "吉林其他高校",
    "U52" : "东北农业大学",
    "U53" : "东北林业大学",
    "U54" : "哈尔滨工业大学",
    "U55" : "哈尔滨工程大学",
    "U1056" : "黑龙江其他高校",
    "U56" : "南京大学",
    "U57" : "东南大学",
    "U58" : "苏州大学",
    "U59" : "河海大学",
    "U60" : "中国药科大学",
    "U61" : "中国矿业大学(徐州)",
    "U62" : "南京师范大学",
    "U63" : "南京理工大学",
    "U64" : "南京航空航天大学",
    "U65" : "江南大学",
    "U66" : "南京农业大学",
    "U1067" : "江苏其他高校",
    "U67" : "浙江大学",
    "U1068" : "浙江其他高校",
    "U68" : "安徽大学",
    "U69" : "合肥工业大学",
    "U70" : "中国科学技术大学",
    "U1071" : "安徽其他高校",
    "U71" : "厦门大学",
    "U72" : "福州大学",
    "U1073" : "福建其他高校",
    "U73" : "南昌大学",
    "U1074" : "江西其他高校",
    "U74" : "山东大学",
    "U75" : "中国海洋大学",
    "U76" : "中国石油大学(华东)",
    "U1077" : "山东其他高校",
    "U77" : "郑州大学",
    "U1078" : "河南其他高校",
    "U78" : "武汉大学",
    "U79" : "华中科技大学",
    "U80" : "中国地质大学(武汉)",
    "U81" : "华中师范大学",
    "U82" : "华中农业大学",
    "U83" : "中南财经政法大学",
    "U84" : "武汉理工大学",
    "U1085" : "湖北其他高校",
    "U85" : "湖南大学",
    "U86" : "中南大学",
    "U87" : "湖南师范大学",
    "U1088" : "湖南其他高校",
    "U88" : "中山大学",
    "U89" : "暨南大学",
    "U90" : "华南理工大学",
    "U91" : "华南师范大学",
    "U1092" : "广东其他高校",
    "U92" : "广西大学",
    "U1093" : "广西其他高校",
    "U93" : "四川大学",
    "U94" : "西南交通大学",
    "U95" : "电子科技大学",
    "U96" : "西南财经大学",
    "U97" : "四川农业大学",
    "U1098" : "四川其他高校",
    "U98" : "云南大学",
    "U1099" : "云南其他高校",
    "U99" : "贵州大学",
    "U1100" : "贵州其他高校",
    "U100" : "西北大学",
    "U101" : "西安交通大学",
    "U102" : "西北工业大学",
    "U103" : "陕西师范大学",
    "U104" : "西北农林科大",
    "U105" : "西安电子科技大学",
    "U106" : "长安大学",
    "U1107" : "山西其他高校",
    "U107" : "兰州大学",
    "U1108" : "甘肃其他高校",
    "U108" : "新疆大学",
    "U109" : "石河子大学",
    "U1110" : "新疆其他高校",
    "U110" : "海南大学",
    "U1111" : "海南其他高校",
    "U111" : "宁夏大学",
    "U1112" : "宁夏其他高校",
    "U112" : "青海大学",
    "U1113" : "青海其他高校",
    "U113" : "西藏大学",
    "U1114" : "西藏其他高校",
    "U114" : "第二军医大学",
    "U115" : "第四军医大学",
    "U116" : "国防科学技术大学",
    "U1117" : "军事系统其他高校"
}

module.exports = {
  provinces,
  universitys,
  idToUniversitys
}
